# Pandas Exercises

같은 폴더 내 두개의 csv 파일을 이용해서 아래 태스크들을(굵은 글씨) 수행하세요.

**모든 태스크들을 되도록 한줄짜리 pandas 코드로 작성해보세요.**

**pandas 라이브러리를 import 하고 banklist.csv 파일을 읽어 DataFrame 을 만드세요.**

**생성된 DataFrame 의 머릿부분을(head) 출력하세요.**

In [26]:
# CODE HERE

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

**칼럼 이름들은 뭐라고 되어있습니까?**

In [ ]:
# CODE HERE

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

**데이터에 포함된 주는(ST) 몇개 입니까?**

In [ ]:
# CODE HERE

44

**ST 칼럼에 최소 한번씩 출현하는 값들을 list 또는 array 형태로 리턴하세요.**

In [ ]:
# CODE HERE

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

**Top 5 states with the number of banks?**

In [ ]:
# CODE HERE

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

**Top 5 Acquiring Institutions?**

In [ ]:
# CODE HERE

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

**State Bank of Texas 에 인수된 은행은 몇개인지, 그중에 실제 텍사스(TX) 에 있는 은행은 몇개인지 보여주는 DataFrame 을 출력하세요**

In [ ]:
# CODE HERE

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

**캘리포니아에서 인수된 은행이 가장 흔한 도시는 어디인가요?**

In [ ]:
# CODE HERE

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

**은행 이름에 "Bank" 가 들어간 은행은 몇개인가요?**

In [ ]:
# CODE HERE

14

**'s' 로 시작되는 은행 이름은 몇개인가요?**

In [ ]:
# CODE HERE

53

**CERT 값이 20000 을 상회하는 경우는 몇개인가요?**

In [61]:
# CODE HERE

417

**"First Bank" 또는 "Bank Georgia" 처럼 두 단어로 된 은행은 몇개인가요?**

In [65]:
# CODE HERE

114